socialrecipe/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])
    if @comment.save
---
INSERT INTO `comments` (`updated_at`, `body`, `recipe_id`, `created_at`) VALUES('2009-04-12 20:44:35', 'very good', 1, '2009-04-12 20:44:35')