socialrecipe/app/controllers/recipes_controller.rb

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM `recipes` WHERE (`recipes`.`id` = 1)

  def create
    @recipe = Recipe.new(params[:recipe])

    if @recipe.save
---
INSERT INTO `recipes` (`updated_at`, `title`, `ingredients`, `summary`, `cooking_time`, `instructions`, `created_at`) VALUES('2009-04-12 20:44:18', 'Lemon Chicken', '1 whole chicken \r\n\r\nSome lemons', 'This is a recipe for lovely lemon chiken', '30-40', 'Cooking time is 30-40 mins', '2009-04-12 20:44:18')